---
kind: method
id: M:Autodesk.Revit.DB.Units.Dispose
source: html/3f01880c-ea78-a3e3-e216-4836503bbda3.htm
---
# Autodesk.Revit.DB.Units.Dispose Method

Releases all resources used by the Units

## Syntax (C#)
```csharp
public void Dispose()
```